app/views/ideas/index.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
<% @ideas.each do |idea| %>
 <p><a href="users/<%= idea.user.id %>"><%= idea.user.first_name %></a> says:</p>

SELECT "ideas".* FROM "ideas"
SELECT COUNT(*) FROM "likes"  WHERE "likes"."idea_id" = ?  [["idea_id", 1]]
---
	<% end %>
	<a href="ideas/<%= idea.id %>"><%= idea.likes.count %> people</a> like this