app/controllers/ideas_controller.rb

  def index
  	@user = User.find(session[:user_id])
    # get all ideas only, without the likes
    all_ideas = Idea.all
    # get all ideas joined by the likes table and ordering them by the likes count
    liked_ideas = Idea.joins(:likes).group(:idea_id).order("count(likes.idea_id) DESC")
  	#@ideas = Idea.all
    @ideas = liked_ideas | all_ideas

  	@likes = Like.all
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ideas".* FROM "ideas"
SELECT "ideas".* FROM "ideas" INNER JOIN "likes" ON "likes"."idea_id" = "ideas"."id" GROUP BY idea_id  ORDER BY count(likes.idea_id) DESC
SELECT "likes".* FROM "likes"

  def create
  	@idea = Idea.new(idea_params)
    if @idea.save
---
INSERT INTO "ideas" ("created_at", "idea", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2016-12-16 15:07:37.203460"], ["idea", "hey"], ["updated_at", "2016-12-16 15:07:37.203460"], ["user_id", 1]]

  def show
  	@user = User.find(session[:user_id])
  	@idea = Idea.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = ? LIMIT 1  [["id", 0]]