app/controllers/likes_controller.rb

  def create
  	@like = Like.new(like_params)
  	@like.save
---
INSERT INTO "likes" ("created_at", "idea_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2016-12-16 15:07:40.376777"], ["idea_id", 1], ["updated_at", "2016-12-16 15:07:40.376777"], ["user_id", 1]]