app/controllers/users_controller.rb

INSERT INTO "users" ("alias", "created_at", "email", "encrypted_password", "first_name", "last_name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 0]]
SELECT COUNT(*) FROM "ideas"  WHERE "ideas"."user_id" = 1
SELECT COUNT(*) FROM "likes"  WHERE "likes"."user_id" = 1
---
  def show
    @user = User.find(params[:id])
    @ideas = Idea.where(user_id: @user.id).count
    @likes = Like.where(user_id: @user.id).count